{
    "semester_0": "<h3>\n Topic: Semester - Calculus, College Experience, and Community Engagement\n</h3>\n<h4>\n <strong>\n  Calculus Journey\n </strong>\n</h4>\n<ul>\n <li>\n  <p>\n   <strong>\n    Students\n   </strong>\n   shared their current progress in\n   <strong>\n    calculus\n   </strong>\n   , with some in\n   <strong>\n    Calc 1\n   </strong>\n   , where they were just starting to learn about\n   <strong>\n    limits\n   </strong>\n   . Others, like\n   <strong>\n    one user\n   </strong>\n   , mentioned being in\n   <strong>\n    Calc 3\n   </strong>\n   , which they found to be more challenging than\n   <strong>\n    Linear Algebra\n   </strong>\n   , despite only being a month into the course. One user expressed that they\n   <strong>\n    found Calc 2\n   </strong>\n   concepts harder compared to\n   <strong>\n    Calc 3\n   </strong>\n   , which they attributed to the\n   <strong>\n    teacher’s teaching style\n   </strong>\n   . In contrast, another user noted that their understanding of\n   <strong>\n    Calc 3\n   </strong>\n   might improve when they retake it in university.\n  </p>\n </li>\n <li>\n  <p>\n   A user also shared that\n   <strong>\n    Calc 1\n   </strong>\n   wasn't that difficult and recommended using\n   <strong>\n    YouTube tutorials\n   </strong>\n   for better explanations, as they found them more helpful than professors' methods. The general consensus was that\n   <strong>\n    calculus\n   </strong>\n   tends to get progressively harder, especially after\n   <strong>\n    Calc 1\n   </strong>\n   . However, some students felt they could handle the increasing difficulty, with one person\n   <strong>\n    joking\n   </strong>\n   that\n   <strong>\n    PearAI\n   </strong>\n   work was harder than\n   <strong>\n    calculus\n   </strong>\n   .\n  </p>\n </li>\n</ul>\n<h4>\n <strong>\n  Work and Streaming\n </strong>\n</h4>\n<ul>\n <li>\n  <strong>\n   Streaming\n  </strong>\n  was a topic of interest, with users asking if\n  <strong>\n   JME\n  </strong>\n  was streaming on a particular day. There was also curiosity about how\n  <strong>\n   JME’s schedule\n  </strong>\n  might change after quitting a job, especially regarding streaming commitments.\n </li>\n</ul>\n<h4>\n <strong>\n  College Experience and Support\n </strong>\n</h4>\n<ul>\n <li>\n  <strong>\n   College apps\n  </strong>\n  and their impact on stress were discussed, with a user sharing that they would be relieved once their applications were complete. Another user reflected on their\n  <strong>\n   college education\n  </strong>\n  , humorously stating that the only thing they learned from college so far was\n  <strong>\n   marketing\n  </strong>\n  , suggesting that\n  <strong>\n   hands-on experience\n  </strong>\n  often provided more valuable learning.\n </li>\n</ul>\n<h4>\n <strong>\n  Community Engagement\n </strong>\n</h4>\n<ul>\n <li>\n  A new member expressed excitement about joining the community and getting involved in\n  <strong>\n   open-source projects\n  </strong>\n  for the first time, highlighting their eagerness to collaborate on\n  <strong>\n   quests\n  </strong>\n  and contribute.\n </li>\n</ul>\n",
    "semester_1": "<h3>\n Topic: Semester - Calculus Challenges, College Experience, and Open-Source Engagement\n</h3>\n<h4>\n <strong>\n  Calculus and Learning Difficulties\n </strong>\n</h4>\n<ul>\n <li>\n  <p>\n   <strong>\n    Students\n   </strong>\n   discussed their experiences with\n   <strong>\n    calculus\n   </strong>\n   courses, with one mentioning difficulty understanding the material due to their\n   <strong>\n    teacher's limited English\n   </strong>\n   skills. They expressed frustration, feeling like it might be a setback. Another student, however, shared that\n   <strong>\n    Calc 1\n   </strong>\n   wasn't as hard as expected and recommended\n   <strong>\n    YouTube tutorials\n   </strong>\n   for better understanding, as they found them more helpful than some professors at university.\n  </p>\n </li>\n <li>\n  <p>\n   The general consensus was that\n   <strong>\n    calculus\n   </strong>\n   would become progressively harder, with one student mentioning they were currently in\n   <strong>\n    Calc 3\n   </strong>\n   , which they found more challenging than\n   <strong>\n    Linear Algebra\n   </strong>\n   . Despite only being a month into the course, they were already struggling, but hoped their\n   <strong>\n    college applications\n   </strong>\n   would be finished soon, which would relieve some stress. Another student reflected on the\n   <strong>\n    Calc 3\n   </strong>\n   experience, noting that the difficulty often depends on the\n   <strong>\n    professor's teaching style\n   </strong>\n   . They had encountered both difficult and easy-to-follow teaching methods for\n   <strong>\n    Calc 3\n   </strong>\n   .\n  </p>\n </li>\n <li>\n  <p>\n   One user pointed out that taking\n   <strong>\n    Calc 3\n   </strong>\n   early could be advantageous, as they might retake it in university and better understand the concepts after gaining more experience.\n  </p>\n </li>\n</ul>\n<h4>\n <strong>\n  College Experience and Streaming\n </strong>\n</h4>\n<ul>\n <li>\n  The conversation shifted to\n  <strong>\n   college life\n  </strong>\n  , with one person commenting that the\n  <strong>\n   only thing they had learned\n  </strong>\n  from college so far was\n  <strong>\n   marketing\n  </strong>\n  . This sentiment suggested that practical experience often offered more value than some formal education, especially in certain fields. Another user inquired if\n  <strong>\n   JME’s streaming schedule\n  </strong>\n  would change after quitting a job, showing interest in how\n  <strong>\n   personal commitments\n  </strong>\n  affect professional activities.\n </li>\n</ul>\n<h4>\n <strong>\n  Open-Source Engagement\n </strong>\n</h4>\n<ul>\n <li>\n  A new community member introduced themselves, expressing excitement about contributing to\n  <strong>\n   open-source projects\n  </strong>\n  for the first time. They were eager to set up a\n  <strong>\n   development environment\n  </strong>\n  and join the team on\n  <strong>\n   quests\n  </strong>\n  . This demonstrated a growing interest in collaborative tech work and contributions from diverse backgrounds.\n </li>\n</ul>\n<h4>\n <strong>\n  Technical Questions\n </strong>\n</h4>\n<ul>\n <li>\n  One person asked for guidance on how to correctly scrape\n  <strong>\n   components\n  </strong>\n  from\n  <strong>\n   NextUI\n  </strong>\n  documentation, indicating a desire to get a tool working properly for their project. They were struggling with the URL configuration to identify components correctly.\n </li>\n</ul>\n",
    "semester_2": "<h3>\n Topic: Semester - Calculus, Discrete Math, and Open-Source Contribution\n</h3>\n<h4>\n <strong>\n  Calculus and Math Challenges\n </strong>\n</h4>\n<ul>\n <li>\n  <p>\n   <strong>\n    Calculus Progress\n   </strong>\n   : The conversation began with someone asking about their peers' progress in\n   <strong>\n    calculus\n   </strong>\n   , specifically around\n   <strong>\n    integrals\n   </strong>\n   . One person mentioned they had just started\n   <strong>\n    Calc 1\n   </strong>\n   and were working on\n   <strong>\n    limits\n   </strong>\n   . Another user noted that\n   <strong>\n    Calc 1\n   </strong>\n   was easier compared to other challenging tasks, like the work involved in\n   <strong>\n    PearAI\n   </strong>\n   .\n  </p>\n </li>\n <li>\n  <p>\n   <strong>\n    Math Difficulty\n   </strong>\n   : The difficulty level of math increased as the conversation shifted to more advanced topics like\n   <strong>\n    discrete math\n   </strong>\n   and\n   <strong>\n    Calc 3\n   </strong>\n   . One user mentioned that\n   <strong>\n    discrete math\n   </strong>\n   was particularly tough for them, primarily due to their\n   <strong>\n    professor’s teaching style\n   </strong>\n   . They also explained that\n   <strong>\n    discrete math\n   </strong>\n   felt like counting on a number line, which contrasted with\n   <strong>\n    partial differential equations (PDEs)\n   </strong>\n   . Another user described\n   <strong>\n    Calc 3\n   </strong>\n   as being harder than\n   <strong>\n    Linear Algebra\n   </strong>\n   , even though they had only been in class for a month. Despite the struggle, they expressed optimism about finishing their\n   <strong>\n    college applications\n   </strong>\n   , which would alleviate some stress.\n  </p>\n </li>\n <li>\n  <p>\n   <strong>\n    Teaching Influence\n   </strong>\n   : The challenge of math often depends on the\n   <strong>\n    professor\n   </strong>\n   , with one user recalling that their\n   <strong>\n    Calc 3\n   </strong>\n   teacher made the material easy to follow, while their first Calc 3 teacher had made it nearly impossible. This highlighted the significant role teaching style plays in understanding difficult concepts. Another student mentioned that they planned to retake\n   <strong>\n    Calc 3\n   </strong>\n   once in university, feeling that a second attempt might make the content easier to grasp.\n  </p>\n </li>\n</ul>\n<h4>\n <strong>\n  Open-Source Contribution\n </strong>\n</h4>\n<ul>\n <li>\n  A new community member introduced themselves, expressing excitement about joining the group and contributing to\n  <strong>\n   open-source projects\n  </strong>\n  for the first time. They were looking forward to setting up their\n  <strong>\n   development environment\n  </strong>\n  and getting involved in the projects, marking their debut in open-source work.\n </li>\n</ul>\n<h4>\n <strong>\n  General Reflections on College\n </strong>\n</h4>\n<ul>\n <li>\n  The conversation touched on the\n  <strong>\n   challenges of college life\n  </strong>\n  , with a user reflecting on how math had always been easy for them until they encountered\n  <strong>\n   discrete math\n  </strong>\n  . They shared that their professor had not helped ease the difficulty of the subject, making it harder to grasp the concepts.\n </li>\n</ul>\n",
    "startup_0": "<h3>\n Topic: Startup - PearAI Development, Team Collaboration, and Outreach\n</h3>\n<h4>\n <strong>\n  Development and Team Collaboration\n </strong>\n</h4>\n<ul>\n <li>\n  <p>\n   <strong>\n    Platform for Documentation\n   </strong>\n   : There was a request to set up a platform or document where all important decisions related to the development stack (frontend, backend, services) could be documented. This would allow team members to refer back to decisions made in previous iterations and continue discussions from where they left off. The response was that all documentation, including backend design and sprint boards, are already available in Google Docs and GitHub, and splitting everything into multiple platforms like Notion might create confusion. For now, the audit log of changes is essentially handled in Discord, with team members encouraged to reach out to\n   <strong>\n    Nang\n   </strong>\n   or\n   <strong>\n    &lt;@100081055595245568&gt;\n   </strong>\n   for clarifications and questions.\n  </p>\n </li>\n <li>\n  <p>\n   <strong>\n    UI/UX Documentation\n   </strong>\n   : In response to ongoing discussions in the UI channel, the need for a place to document UI/UX decisions was acknowledged. A\n   <strong>\n    UI/UX design folder\n   </strong>\n   on Google Drive was created for team members interested in contributing, and anyone wanting write access was invited to DM their email. This folder also contains demos and screenshots of PearAI in action, ensuring better tracking and summarization of design decisions.\n  </p>\n </li>\n</ul>\n<h4>\n <strong>\n  Team Engagement and Updates\n </strong>\n</h4>\n<ul>\n <li>\n  <p>\n   <strong>\n    Dev Streams and Communication\n   </strong>\n   : There were inquiries about the scheduling of development streams, with some proposing that\n   <strong>\n    voice chats\n   </strong>\n   or\n   <strong>\n    stand-up meetings\n   </strong>\n   could be useful to address concerns and share updates. Additionally, a suggestion was made to create a\n   <strong>\n    company LinkedIn page\n   </strong>\n   for PearAI, recognizing the platform's importance for undergrad students seeking internships and entry-level roles, despite its drawbacks.\n  </p>\n </li>\n <li>\n  <p>\n   <strong>\n    Video Content Strategy\n   </strong>\n   : When discussing video content for PearAI, there were suggestions on whether updates should be posted on the main channel or a dedicated startup channel. The consensus was that major updates, like the UI revamp, should be featured on the main channel, while smaller updates could go on the startup channel. A user also proposed using the main channel for content that subtly promotes PearAI without making it the central focus.\n  </p>\n </li>\n</ul>\n<h4>\n <strong>\n  Outreach and Networking\n </strong>\n</h4>\n<ul>\n <li>\n  <p>\n   <strong>\n    Networking and Personal Branding\n   </strong>\n   : There was a light-hearted exchange about\n   <strong>\n    networking\n   </strong>\n   and\n   <strong>\n    personal branding\n   </strong>\n   . One user jokingly noted how they preferred networking with\n   <strong>\n    Pan\n   </strong>\n   (likely a key figure in PearAI) over more formal connections like a\n   <strong>\n    Microsoft Software Engineer (SWE)\n   </strong>\n   . Another user noted their\n   <strong>\n    LinkedIn profile\n   </strong>\n   mentioned Pan in a prominent way, while another declared that they preferred networking with Pan rather than traditional tech company representatives.\n  </p>\n </li>\n <li>\n  <p>\n   <strong>\n    PearAI Interns\n   </strong>\n   : A fun mention was made that\n   <strong>\n    300 interns\n   </strong>\n   work at PearAI, reflecting the scale and opportunity within the startup. The growing team and the appeal of the company to students were emphasized, with another user humorously pointing out the ongoing trend of everyone in the team using a\n   <strong>\n    Mac\n   </strong>\n   , highlighting its popularity in the startup environment.\n  </p>\n </li>\n</ul>\n",
    "startup_1": "<h3>\n Topic: Startup - PearAI Development and Growth\n</h3>\n<h4>\n <strong>\n  Technology and Tools\n </strong>\n</h4>\n<ul>\n <li>\n  <p>\n   <strong>\n    Nostalgia for Atom Editor\n   </strong>\n   : There was a brief conversation about the Atom editor, with some users expressing nostalgia for it. One user mentioned that\n   <strong>\n    Zed\n   </strong>\n   is Atom's successor and is a strong alternative to Electron-based code editors, offering good performance.\n  </p>\n </li>\n <li>\n  <p>\n   <strong>\n    Codeium and Competition\n   </strong>\n   : A user shared an article about\n   <strong>\n    API GEN\n   </strong>\n   , a startup created by high school friends, which is focused on API creation based on prompts. Though it's not fully implemented yet, it was mentioned as a potential competitor to PearAI, particularly in the AI space.\n  </p>\n </li>\n <li>\n  <p>\n   <strong>\n    CI/CD and Electron Issues\n   </strong>\n   : In the context of PearAI’s development, there were some issues related to\n   <strong>\n    CI/CD failures\n   </strong>\n   , particularly when running\n   <strong>\n    unit tests\n   </strong>\n   and\n   <strong>\n    Electron\n   </strong>\n   on different systems. One user was concerned that no one was receiving emails about these failures, as they were preventing progress. Others confirmed issues on their systems, such as running\n   <strong>\n    Electron on macOS\n   </strong>\n   . A user on\n   <strong>\n    Fedora Linux\n   </strong>\n   noted no problems, and there was a suggestion to check a specific channel for troubleshooting. The\n   <strong>\n    yarn test-node\n   </strong>\n   command also posed issues for macOS users, prompting discussions about disabling tests in CI if the failures were widespread.\n  </p>\n </li>\n</ul>\n<h4>\n <strong>\n  Development Journey and Learning\n </strong>\n</h4>\n<ul>\n <li>\n  <p>\n   <strong>\n    Early Coding Experiences\n   </strong>\n   : Several users shared their experiences with coding and how they started at a young age. One person mentioned starting at\n   <strong>\n    15 years old\n   </strong>\n   , while another user started later at\n   <strong>\n    17\n   </strong>\n   . Despite early starts, some admitted to being inconsistent, with one user noting they hadn’t written any code for\n   <strong>\n    four months\n   </strong>\n   before they began working on PearAI, which reignited their passion.\n  </p>\n </li>\n <li>\n  <p>\n   <strong>\n    Learning Git\n   </strong>\n   : One user humorously reflected on their learning process, recalling how they had learned\n   <strong>\n    Git\n   </strong>\n   a day after claiming an issue to work on. Despite finishing the task quickly, they spent an entire day figuring out how to send a pull request (PR), admitting it was \"probably irresponsible,\" but ultimately figuring it out.\n  </p>\n </li>\n</ul>\n<h4>\n <strong>\n  Team Engagement and Motivation\n </strong>\n</h4>\n<ul>\n <li>\n  <p>\n   <strong>\n    Joining the Community and Contributing\n   </strong>\n   : A user mentioned they were still learning\n   <strong>\n    Git\n   </strong>\n   but was willing to take on an issue if they thought they could tackle it. The community encouraged everyone to join quests and contribute, reflecting the inclusive and supportive atmosphere within the startup.\n  </p>\n </li>\n <li>\n  <p>\n   <strong>\n    Personal Milestones\n   </strong>\n   : There was a shared sense of personal growth, with users reflecting on their progress from their early days of coding. One user remarked that they were fine even if they started later, emphasizing that the journey and consistency mattered more than the timeline.\n  </p>\n </li>\n</ul>\n<h3>\n <strong>\n  Conclusion\n </strong>\n</h3>\n<p>\n In the context of PearAI, the conversation blended technical challenges with personal experiences, such as troubleshooting CI/CD issues, discussing the use of\n <strong>\n  Electron\n </strong>\n , and reflecting on individual coding journeys. The community remains engaged and supportive, with members willing to contribute to the startup, learn from each other, and help troubleshoot development issues.\n</p>\n"
}