{
    "spline_0": "## Introduction to Spline\nThe conversation starts with a discussion about spline, with a user expressing uncertainty about its use in games (DMessage 15298). Another user asks for an explanation of what spline is and how to use it, noting that it looks great (DMessage 15299).\n\n## Understanding Spline\nA user mentions that spline looks nice and asks for a graphics pack link (DMessage 15300). However, it becomes clear that there is confusion about what spline is, with another user simply typing \"spline?\" (DMessage 15301). A more informed user chimes in, mentioning spline filter and bicubic filter (DMessage 15302), but this only leads to more questions about how to use spline (DMessage 15303).\n\n## Clarification on Spline\nIt is eventually revealed that spline is not a downloadable graphic pack, but rather an interpolation algorithm (DMessage 15310). A user regrets posting about it, as it was only meant to serve as proof for a discussion on Reddit (DMessage 15310).\n\n## Graphic Packs for Games\nThe conversation takes a turn when a user asks about a 1080p graphic pack for Mario Kart 8 (DMessage 15307). Another user provides a link to a repository of graphic packs for Cemu, a Wii U emulator (DMessage 15308). However, it becomes clear that the latest version of Cemu (1.9.0.c) does not come with graphic packs, and a user requests links to 1080p packs for Mario 3D World and Super Smash Bros. (DMessage 15311).\n\n## Conclusion\nIn conclusion, the conversation about spline starts with confusion and uncertainty, but eventually, it is clarified that spline is an interpolation algorithm, not a downloadable graphic pack (DMessage 15310). The conversation then shifts to a discussion about graphic packs for games, with users requesting and sharing links to packs for various games (DMessage 15308, DMessage 15311).\n",
    "spline_1": "## Introduction to Spline Conversation\nThe conversation revolves around the topic of spline, a type of interpolation technique used in graphics rendering. The discussion starts with a question about whether an update still works with Nsight (DMessage 28912) and proceeds to address various issues and implementation details related to spline interpolation.\n\n## Spline Interpolation and Rendering Issues\nThe conversation delves into problems with image shifts when using spline interpolation, with some users experiencing shifts to the up-left corner compared to bilinear interpolation (DMessage 28921). It is noted that bilinear interpolation seems to be the only one not exhibiting this shift, with bicubic and spline showing similar behavior (DMessage 28929). There is also a discussion about the inefficiency of the spline interpolation implementation (DMessage 28931).\n\n## Downscaling and Pixelation\nDownscaling is identified as a major issue, causing pixelation and a \"shitty pixaled view\" (DMessage 28936). An \"always use bilinear when downscaling\" option is mentioned (DMessage 28937), and the concept of super sampling for downscaling high-resolution images to lower-resolution displays is introduced (DMessage 28942).\n\n## OpenGL, Cemuhook, and Custom DLL Development\nThe conversation also touches on the development of a custom OpenGL32.dll, similar to Cemuhook, which is experiencing issues with certain OpenGL settings (DMessage 28986). The use of Cemuhook for editing and Clarity, a graphics enhancement tool, is mentioned (DMessage 28991 and DMessage 28993).\n\n## Debugging and Solution\nThroughout the conversation, users share their experiences, provide feedback, and help each other troubleshoot issues. A solution is eventually found, with one user deleting old files and downloading the latest versions, resolving their issue (DMessage 28975).\n\n## Conclusion\nIn summary, the conversation covers various aspects of spline interpolation, including rendering issues, downscaling, and the development of custom graphics tools. The discussion highlights the complexities and challenges associated with graphics rendering and the importance of community collaboration in resolving these issues.\n"
}